/*****************************************************************************/
/*                                                  ###                      */
/*       #####          ###    ###                  ###  CREATE: 2010-11-11  */
/*     #######          ###    ###      [SOFT]      ###  ~~~~~~~~~~~~~~~~~~  */
/*    ########          ###    ###                  ###  MODIFY: XXXX-XX-XX  */
/*    ####  ##          ###    ###                  ###  ~~~~~~~~~~~~~~~~~~  */
/*   ###       ### ###  ###    ###    ####    ####  ###   ##  +-----------+  */
/*  ####       ######## ##########  #######  ###### ###  ###  |  A NEW C  |  */
/*  ###        ######## ########## ########  ###### ### ###   | FRAMEWORK |  */
/*  ###     ## #### ### ########## ###  ### ###     ######    |  FOR ALL  |  */
/*  ####   ### ###  ### ###    ### ###  ### ###     ######    | PLATFORMS |  */
/*  ########## ###      ###    ### ######## ####### #######   |  AND ALL  |  */
/*   #######   ###      ###    ### ########  ###### ###  ###  | COMPILERS |  */
/*    #####    ###      ###    ###  #### ##   ####  ###   ##  +-----------+  */
/*  =======================================================================  */
/*  >>>>>>>>>>>>>>>>>>> DTM_NEXT 指纹识别设备驱动头文件 <<<<<<<<<<<<<<<<<<<  */
/*  =======================================================================  */
/*****************************************************************************/

#ifndef __CR_FINGER_H__
#define __CR_FINGER_H__

#include "devlib.h"

/*****************************************************************************/
/*                                驱动控制码                                 */
/*****************************************************************************/

#define FNG_GET_INFOR       0x0000      /* 获取设备信息 */
#define FNG_SET_PARAM       0x0001      /* 设置采集系数 */
#define FNG_GET_PICTURE     0x0002      /* 采集指纹图像 */
#define FNG_GET_DESCOMP     0x0003      /* 采集指纹模板 */
#define FNG_GET_ALL_DATA    0x0004      /* 采集图像模板 */
#define FNG_CHECK_FINGER    0x0005      /* 验证当前指纹 */

/* 指纹驱动信息结构 */
typedef struct
{
        uint_t  pic_w;  /* 图片的宽 */
        uint_t  pic_h;  /* 图片的高 */
        leng_t  dsize;  /* 模板大小 */

} sFINGER_INFO;

/*****************************************************************************/
/*                                驱动错误码                                 */
/*****************************************************************************/

/* JZT-969A 指纹仪出错代码值 */
#define CR_DEVB_ERR_FNG_JZT969A_PICT    CR_ERRS(0x6000UL)   /* 采集图像失败 */
#define CR_DEVB_ERR_FNG_JZT969A_EXTR    CR_ERRS(0x6001UL)   /* 抽取特征失败 */
#define CR_DEVB_ERR_FNG_JZT969A_VERY    CR_ERRS(0x6002UL)   /* 比较指纹失败 */
#define CR_DEVB_ERR_FNG_JZT969A_ENRL    CR_ERRS(0x6003UL)   /* 合成模板失败 */

/*****************************************************************************/
/*                                驱动注册表                                 */
/*****************************************************************************/

CR_API const sDEV_BNODE _rom_ g_fng_jzt969a;    /* JZT-969A */

#endif  /* !__CR_FINGER_H__ */

/*****************************************************************************/
/* _________________________________________________________________________ */
/* uBMAzRBoAKAHaACQD6FoAIAPqbgA/7rIA+5CM9uKw8D4Au7u7mSIJ0t18mYz0mYz9rAQZCgHc */
/* wRIZIgHZovGBXUAZg+v0GbB+gRmgcJ7BAAAisIlAwB1Av7LSHUC/s9IdQL+w0h1Av7HZkZmgf */
/* 4JLgIAdb262gPsqAh0+zP/uQB9ZYsFZYktq+L3sMi/AAK7gAKJAUtLdfq5IANXvT8BiQzfBIv */
/* FLaAAweAEmff53wb+Adjx3kQE2xwy5Io8ithkigcFgACJBN8E3sneNvwB2xyLHDkdfA2JHSyA */
/* adtAAQPdZYgHR0dNdbZfSYP5UHWr/kQEtAHNFg+Eef/DWAKgDw== |~~~~~~~~~~~~~~~~~~~ */
/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ >>> END OF FILE <<< */
/*****************************************************************************/
