/*****************************************************************************/
/*                                                  ###                      */
/*       #####          ###    ###                  ###  CREATE: 2012-04-06  */
/*     #######          ###    ###      [CORE]      ###  ~~~~~~~~~~~~~~~~~~  */
/*    ########          ###    ###                  ###  MODIFY: XXXX-XX-XX  */
/*    ####  ##          ###    ###                  ###  ~~~~~~~~~~~~~~~~~~  */
/*   ###       ### ###  ###    ###    ####    ####  ###   ##  +-----------+  */
/*  ####       ######## ##########  #######  ###### ###  ###  |  A NEW C  |  */
/*  ###        ######## ########## ########  ###### ### ###   | FRAMEWORK |  */
/*  ###     ## #### ### ########## ###  ### ###     ######    |  FOR ALL  |  */
/*  ####   ### ###  ### ###    ### ###  ### ###     ######    | PLATFORMS |  */
/*  ########## ###      ###    ### ######## ####### #######   |  AND ALL  |  */
/*   #######   ###      ###    ### ########  ###### ###  ###  | COMPILERS |  */
/*    #####    ###      ###    ###  #### ##   ####  ###   ##  +-----------+  */
/*  =======================================================================  */
/*  >>>>>>>>>>>>>>>>>>> CrHack 动态模块函数库 for Naked <<<<<<<<<<<<<<<<<<<  */
/*  =======================================================================  */
/*****************************************************************************/

#include "plugin.h"

/*
=======================================
    加载动态模块A
=======================================
*/
CR_API sbin_t
sbin_loadA (
  __CR_IN__ const ansi_t*   name
    )
{
    CR_NOUSE(name);
    return (NULL);
}

/*
=======================================
    加载动态模块W
=======================================
*/
CR_API sbin_t
sbin_loadW (
  __CR_IN__ const wide_t*   name
    )
{
    CR_NOUSE(name);
    return (NULL);
}

/*
=======================================
    卸载动态模块
=======================================
*/
CR_API bool_t
sbin_unload (
  __CR_IN__ sbin_t  sbin
    )
{
    CR_NOUSE(sbin);
    return (FALSE);
}

/*
=======================================
    获取模块导出项地址
=======================================
*/
CR_API void_t*
sbin_export (
  __CR_IN__ sbin_t          sbin,
  __CR_IN__ const ansi_t*   name
    )
{
    CR_NOUSE(sbin);
    CR_NOUSE(name);
    return (NULL);
}

/*
=======================================
    获取已加载的模块A
=======================================
*/
CR_API sbin_t
sbin_testA (
  __CR_IN__ const ansi_t*   name
    )
{
    CR_NOUSE(name);
    return (NULL);
}

/*
=======================================
    获取已加载的模块W
=======================================
*/
CR_API sbin_t
sbin_testW (
  __CR_IN__ const wide_t*   name
    )
{
    CR_NOUSE(name);
    return (NULL);
}

/*****************************************************************************/
/* _________________________________________________________________________ */
/* uBMAzRBoAKAHaACQD6FoAIAPqbgA/7rIA+5CM9uKw8D4Au7u7mSIJ0t18mYz0mYz9rAQZCgHc */
/* wRIZIgHZovGBXUAZg+v0GbB+gRmgcJ7BAAAisIlAwB1Av7LSHUC/s9IdQL+w0h1Av7HZkZmgf */
/* 4JLgIAdb262gPsqAh0+zP/uQB9ZYsFZYktq+L3sMi/AAK7gAKJAUtLdfq5IANXvT8BiQzfBIv */
/* FLaAAweAEmff53wb+Adjx3kQE2xwy5Io8ithkigcFgACJBN8E3sneNvwB2xyLHDkdfA2JHSyA */
/* adtAAQPdZYgHR0dNdbZfSYP5UHWr/kQEtAHNFg+Eef/DWAKgDw== |~~~~~~~~~~~~~~~~~~~ */
/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ >>> END OF FILE <<< */
/*****************************************************************************/
