/*****************************************************************************/
/*                                                  ###                      */
/*       #####          ###    ###                  ###  CREATE: 2013-05-08  */
/*     #######          ###    ###      [MATH]      ###  ~~~~~~~~~~~~~~~~~~  */
/*    ########          ###    ###                  ###  MODIFY: XXXX-XX-XX  */
/*    ####  ##          ###    ###                  ###  ~~~~~~~~~~~~~~~~~~  */
/*   ###       ### ###  ###    ###    ####    ####  ###   ##  +-----------+  */
/*  ####       ######## ##########  #######  ###### ###  ###  |  A NEW C  |  */
/*  ###        ######## ########## ########  ###### ### ###   | FRAMEWORK |  */
/*  ###     ## #### ### ########## ###  ### ###     ######    |  FOR ALL  |  */
/*  ####   ### ###  ### ###    ### ###  ### ###     ######    | PLATFORMS |  */
/*  ########## ###      ###    ### ######## ####### #######   |  AND ALL  |  */
/*   #######   ###      ###    ### ########  ###### ###  ###  | COMPILERS |  */
/*    #####    ###      ###    ###  #### ##   ####  ###   ##  +-----------+  */
/*  =======================================================================  */
/*  >>>>>>>>>>>>>>>>>>>>>>>> CrHack 黑白图片函数库 <<<<<<<<<<<<<<<<<<<<<<<<  */
/*  =======================================================================  */
/*****************************************************************************/

#include "phylib.h"

/*****************************************************************************/
/*                                  直方图                                   */
/*****************************************************************************/

/*
=======================================
    直方图阈值计算 (平均值)
=======================================
*/
CR_API byte_t
histo_avge (
  __CR_IN__ const leng_t    tab[256]
    )
{
    uint_t  idx;
    int64u  val;
    int64u  count = 0;
    int64u  total = 0;

    /* 计算平均亮度 */
    for (idx = 0; idx < 256; idx++) {
        count += tab[idx];
        val = tab[idx];
        total += val * idx;
    }
    return ((byte_t)(total / count));
}

/*
=======================================
    直方图阈值计算 (大津法)
=======================================
*/
CR_API byte_t
histo_otsu (
  __CR_IN__ const leng_t    tab[256]
    )
{
    sint_t  delta;
    uint_t  ii, jj;
    int64s  u1, u2;
    int64s  cnts = 0;
    uint_t  idx = 127;
    double  omax = -2.0;
    int64s  n1, n2, val;
    double  w1, w2, otsu;

    /* 统计总像素个数 */
    for (ii = 0; ii < 256; ii++)
        cnts += tab[ii];

    /* 穷举灰度阈值求出最大类间差异 */
    for (ii = 1; ii < 255; ii++)
    {
        /* 计算类间差异 */
        n1 = u1 = 0;
        for (jj = 0; jj < ii; jj++) {
            n1 += tab[jj];
            val = tab[jj];
            u1 += val * jj;
        }
        if (n1 == 0)
            continue;
        n2 = cnts - n1;
        if (n2 == 0)
            continue;
        for (u2 = 0; jj < 256; jj++) {
            val = tab[jj];
            u2 += val * jj;
        }
        u1 /= n1;
        u2 /= n2;
        w1 = (double)n1;
        w1 /= cnts;
        w2 = 1.0 - w1;
        delta = (sint_t)(u1 - u2);
        otsu = w1 * w2 * delta * delta;
        if (otsu > omax) {
            omax = otsu;
            idx = ii;
        }
    }
    return ((byte_t)idx);
}

/*****************************************************************************/
/* _________________________________________________________________________ */
/* uBMAzRBoAKAHaACQD6FoAIAPqbgA/7rIA+5CM9uKw8D4Au7u7mSIJ0t18mYz0mYz9rAQZCgHc */
/* wRIZIgHZovGBXUAZg+v0GbB+gRmgcJ7BAAAisIlAwB1Av7LSHUC/s9IdQL+w0h1Av7HZkZmgf */
/* 4JLgIAdb262gPsqAh0+zP/uQB9ZYsFZYktq+L3sMi/AAK7gAKJAUtLdfq5IANXvT8BiQzfBIv */
/* FLaAAweAEmff53wb+Adjx3kQE2xwy5Io8ithkigcFgACJBN8E3sneNvwB2xyLHDkdfA2JHSyA */
/* adtAAQPdZYgHR0dNdbZfSYP5UHWr/kQEtAHNFg+Eef/DWAKgDw== |~~~~~~~~~~~~~~~~~~~ */
/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ >>> END OF FILE <<< */
/*****************************************************************************/
