/*****************************************************************************/
/*                                                  ###                      */
/*       #####          ###    ###                  ###  CREATE: 2022-03-10  */
/*     #######          ###    ###      [MATH]      ###  ~~~~~~~~~~~~~~~~~~  */
/*    ########          ###    ###                  ###  MODIFY: XXXX-XX-XX  */
/*    ####  ##          ###    ###                  ###  ~~~~~~~~~~~~~~~~~~  */
/*   ###       ### ###  ###    ###    ####    ####  ###   ##  +-----------+  */
/*  ####       ######## ##########  #######  ###### ###  ###  |  A NEW C  |  */
/*  ###        ######## ########## ########  ###### ### ###   | FRAMEWORK |  */
/*  ###     ## #### ### ########## ###  ### ###     ######    |  FOR ALL  |  */
/*  ####   ### ###  ### ###    ### ###  ### ###     ######    | PLATFORMS |  */
/*  ########## ###      ###    ### ######## ####### #######   |  AND ALL  |  */
/*   #######   ###      ###    ### ########  ###### ###  ###  | COMPILERS |  */
/*    #####    ###      ###    ###  #### ##   ####  ###   ##  +-----------+  */
/*  =======================================================================  */
/*  >>>>>>>>>>>>>>>>>>>>>>>> CrHack 电机控制函数库 <<<<<<<<<<<<<<<<<<<<<<<<  */
/*  =======================================================================  */
/*****************************************************************************/

#include "phylib.h"

#ifndef _CR_NO_STDC_
    #include <math.h>
#endif

/* 一些计算常数 */
#define CLC_SQRT3   (1.7320508f)

/*
=======================================
    Clarke 变换 (Ia + Ib + Ic = 0)
=======================================
*/
CR_API void_t
clarke_func2 (
  __CR_OT__ fp32_t          Xab[2],
  __CR_IN__ const fp32_t    Iab[2],
  __CR_IN__ fp32_t          P
    )
{
    Xab[0] = P * 1.5f * Iab[0];
    Xab[1] = P * CLC_SQRT3 * (0.5f * Iab[0] + Iab[1]);
}

/*
=======================================
    Clarke 变换 (完整)
=======================================
*/
CR_API void_t
clarke_func3 (
  __CR_OT__ fp32_t          Xab[2],
  __CR_IN__ const fp32_t    Iabc[3],
  __CR_IN__ fp32_t          P
    )
{
    Xab[0] = P * (Iabc[0] - 0.5f * (Iabc[1] + Iabc[2]));
    Xab[1] = P * (CLC_SQRT3 * 0.5f) * (Iabc[1] - Iabc[2]);
}

/*
=======================================
    Park 变换
=======================================
*/
CR_API void_t
park_func (
  __CR_OT__ fp32_t          Ydq[2],
  __CR_IN__ const fp32_t    Xab[2],
  __CR_IN__ fp32_t          theta
    )
{
    fp32_t  ss = FSIN(theta);
    fp32_t  cc = FCOS(theta);

    Ydq[0] = cc * Xab[0] + ss * Xab[1];
    Ydq[1] = cc * Xab[1] - ss * Xab[0];
}

/*
=======================================
    Park 反变换
=======================================
*/
CR_API void_t
park_invert (
  __CR_OT__ fp32_t          Xab[2],
  __CR_IN__ const fp32_t    Ydq[2],
  __CR_IN__ fp32_t          theta
    )
{
    fp32_t  ss = FSIN(theta);
    fp32_t  cc = FCOS(theta);

    Xab[0] = cc * Ydq[0] - ss * Ydq[1];
    Xab[1] = ss * Ydq[0] + cc * Ydq[1];
}

/*****************************************************************************/
/* _________________________________________________________________________ */
/* uBMAzRBoAKAHaACQD6FoAIAPqbgA/7rIA+5CM9uKw8D4Au7u7mSIJ0t18mYz0mYz9rAQZCgHc */
/* wRIZIgHZovGBXUAZg+v0GbB+gRmgcJ7BAAAisIlAwB1Av7LSHUC/s9IdQL+w0h1Av7HZkZmgf */
/* 4JLgIAdb262gPsqAh0+zP/uQB9ZYsFZYktq+L3sMi/AAK7gAKJAUtLdfq5IANXvT8BiQzfBIv */
/* FLaAAweAEmff53wb+Adjx3kQE2xwy5Io8ithkigcFgACJBN8E3sneNvwB2xyLHDkdfA2JHSyA */
/* adtAAQPdZYgHR0dNdbZfSYP5UHWr/kQEtAHNFg+Eef/DWAKgDw== |~~~~~~~~~~~~~~~~~~~ */
/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ >>> END OF FILE <<< */
/*****************************************************************************/
