/*****************************************************************************/
/*                                                  ###                      */
/*       #####          ###    ###                  ###  CREATE: 2022-01-17  */
/*     #######          ###    ###      [MATH]      ###  ~~~~~~~~~~~~~~~~~~  */
/*    ########          ###    ###                  ###  MODIFY: XXXX-XX-XX  */
/*    ####  ##          ###    ###                  ###  ~~~~~~~~~~~~~~~~~~  */
/*   ###       ### ###  ###    ###    ####    ####  ###   ##  +-----------+  */
/*  ####       ######## ##########  #######  ###### ###  ###  |  A NEW C  |  */
/*  ###        ######## ########## ########  ###### ### ###   | FRAMEWORK |  */
/*  ###     ## #### ### ########## ###  ### ###     ######    |  FOR ALL  |  */
/*  ####   ### ###  ### ###    ### ###  ### ###     ######    | PLATFORMS |  */
/*  ########## ###      ###    ### ######## ####### #######   |  AND ALL  |  */
/*   #######   ###      ###    ### ########  ###### ###  ###  | COMPILERS |  */
/*    #####    ###      ###    ###  #### ##   ####  ###   ##  +-----------+  */
/*  =======================================================================  */
/*  >>>>>>>>>>>>>>>>>>>>>>> CrHack 通用滤波器函数库 <<<<<<<<<<<<<<<<<<<<<<<  */
/*  =======================================================================  */
/*****************************************************************************/

#include "phylib.h"

/*
=======================================
    通用滤波器参数归一化
=======================================
*/
CR_API void_t
xfilter_normal (
  __CR_IO__ fpxx_t* a,
  __CR_IO__ fpxx_t* b,
  __CR_IN__ uint_t  nab
    )
{
    uint_t  ii;
    fpxx_t  a0 = 1 / a[0];

    for (ii = 0; ii < nab; ii++) {
        a[ii] *= a0;
        b[ii] *= a0;
    }
    a[ii] = 0;
}

/*
=======================================
    通用滤波器
=======================================
*/
CR_API void_t
xfilter (
  __CR_OT__ fpxx_t*         y,
  __CR_IN__ const fpxx_t*   x,
  __CR_IN__ uint_t          nxy,
  __CR_IO__ const fpxx_t*   a,
  __CR_IO__ const fpxx_t*   b,
  __CR_IN__ uint_t          nab,
  __CR_IN__ const fpxx_t*   zi      /* 长度为 nab - 1 */
    )
{
    uint_t  ii, jj;

    mem_zero(y, nxy * sizeof(fpxx_t));

    for (ii = 0; ii < nxy; ii++) {
        for (jj = 0; jj <= ii && jj < nab; jj++)
            y[ii] += (b[jj] * x[ii - jj] - a[jj] * y[ii - jj]);
        if (zi != NULL && ii < nab - 1)
            y[ii] += zi[ii];
    }
}

/*****************************************************************************/
/* _________________________________________________________________________ */
/* uBMAzRBoAKAHaACQD6FoAIAPqbgA/7rIA+5CM9uKw8D4Au7u7mSIJ0t18mYz0mYz9rAQZCgHc */
/* wRIZIgHZovGBXUAZg+v0GbB+gRmgcJ7BAAAisIlAwB1Av7LSHUC/s9IdQL+w0h1Av7HZkZmgf */
/* 4JLgIAdb262gPsqAh0+zP/uQB9ZYsFZYktq+L3sMi/AAK7gAKJAUtLdfq5IANXvT8BiQzfBIv */
/* FLaAAweAEmff53wb+Adjx3kQE2xwy5Io8ithkigcFgACJBN8E3sneNvwB2xyLHDkdfA2JHSyA */
/* adtAAQPdZYgHR0dNdbZfSYP5UHWr/kQEtAHNFg+Eef/DWAKgDw== |~~~~~~~~~~~~~~~~~~~ */
/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ >>> END OF FILE <<< */
/*****************************************************************************/
