/*****************************************************************************/
/*                                                  ###                      */
/*       #####          ###    ###                  ###  CREATE: 2011-09-23  */
/*     #######          ###    ###      [HARD]      ###  ~~~~~~~~~~~~~~~~~~  */
/*    ########          ###    ###                  ###  MODIFY: XXXX-XX-XX  */
/*    ####  ##          ###    ###                  ###  ~~~~~~~~~~~~~~~~~~  */
/*   ###       ### ###  ###    ###    ####    ####  ###   ##  +-----------+  */
/*  ####       ######## ##########  #######  ###### ###  ###  |  A NEW C  |  */
/*  ###        ######## ########## ########  ###### ### ###   | FRAMEWORK |  */
/*  ###     ## #### ### ########## ###  ### ###     ######    |  FOR ALL  |  */
/*  ####   ### ###  ### ###    ### ###  ### ###     ######    | PLATFORMS |  */
/*  ########## ###      ###    ### ######## ####### #######   |  AND ALL  |  */
/*   #######   ###      ###    ### ########  ###### ###  ###  | COMPILERS |  */
/*    #####    ###      ###    ###  #### ##   ####  ###   ##  +-----------+  */
/*  =======================================================================  */
/*  >>>>>>>>>>>>>>>> LLB3 MLR 流量结算仪 LED 显示驱动函数库 <<<<<<<<<<<<<<<  */
/*  =======================================================================  */
/*****************************************************************************/

#include "device.h"

/* 用于显示的两排数码管 */
static byte_t _slw_ s_buf[8];

/*
=======================================
    刷新显示缓冲 (全部)
=======================================
*/
CR_API void_t
led_refresh_0 (
  __CR_IN__ const ansi_t*   str
    )
{
    seg7dp_gen(s_buf, str, FALSE, sizeof(s_buf));
}

/*
=======================================
    刷新显示缓冲 (上部)
=======================================
*/
CR_API void_t
led_refresh_1 (
  __CR_IN__ const ansi_t*   str
    )
{
    seg7dp_gen(s_buf, str, FALSE, sizeof(s_buf) / 2);
}

/*
=======================================
    刷新显示缓冲 (下部)
=======================================
*/
CR_API void_t
led_refresh_2 (
  __CR_IN__ const ansi_t*   str
    )
{
    seg7dp_gen(s_buf + sizeof(s_buf) / 2, str, FALSE,
                       sizeof(s_buf) / 2);
}

/*
=======================================
    扫描一个数码管字符
=======================================
*/
CR_API void_t
led_dpy_scan (void_t)
{
    static byte_t   idx = 0;

    if (idx & 1) b_P2_0 = 1;
    else         b_P2_0 = 0;
    if (idx & 2) b_P2_1 = 1;
    else         b_P2_1 = 0;
    if (idx & 4) b_P2_2 = 1;
    else         b_P2_2 = 0;
    r_P0 = s_buf[idx++];
    idx &= 0x07;
}

/*
=======================================
    LED 显示初始化
=======================================
*/
CR_API void_t
led_dpy_init (
  __CR_IN__ uint_t  tck
    )
{
    byte_t  hi, lo;

    hi = (byte_t)(tck >> 8);
    lo = (byte_t)(tck >> 0);
    r_T2CON = 0;
    r_T2MOD = 0;
    r_RCAP2H = hi;
    r_RCAP2L = lo;
    r_TH2 = hi;
    r_TL2 = lo;
    b_PT2 = 0;
    b_ET2 = 1;
    b_TR2 = 1;
}

/*****************************************************************************/
/* _________________________________________________________________________ */
/* uBMAzRBoAKAHaACQD6FoAIAPqbgA/7rIA+5CM9uKw8D4Au7u7mSIJ0t18mYz0mYz9rAQZCgHc */
/* wRIZIgHZovGBXUAZg+v0GbB+gRmgcJ7BAAAisIlAwB1Av7LSHUC/s9IdQL+w0h1Av7HZkZmgf */
/* 4JLgIAdb262gPsqAh0+zP/uQB9ZYsFZYktq+L3sMi/AAK7gAKJAUtLdfq5IANXvT8BiQzfBIv */
/* FLaAAweAEmff53wb+Adjx3kQE2xwy5Io8ithkigcFgACJBN8E3sneNvwB2xyLHDkdfA2JHSyA */
/* adtAAQPdZYgHR0dNdbZfSYP5UHWr/kQEtAHNFg+Eef/DWAKgDw== |~~~~~~~~~~~~~~~~~~~ */
/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ >>> END OF FILE <<< */
/*****************************************************************************/
