/*****************************************************************************/
/*                                                  ###                      */
/*       #####          ###    ###                  ###  CREATE: 2011-10-08  */
/*     #######          ###    ###      [HARD]      ###  ~~~~~~~~~~~~~~~~~~  */
/*    ########          ###    ###                  ###  MODIFY: XXXX-XX-XX  */
/*    ####  ##          ###    ###                  ###  ~~~~~~~~~~~~~~~~~~  */
/*   ###       ### ###  ###    ###    ####    ####  ###   ##  +-----------+  */
/*  ####       ######## ##########  #######  ###### ###  ###  |  A NEW C  |  */
/*  ###        ######## ########## ########  ###### ### ###   | FRAMEWORK |  */
/*  ###     ## #### ### ########## ###  ### ###     ######    |  FOR ALL  |  */
/*  ####   ### ###  ### ###    ### ###  ### ###     ######    | PLATFORMS |  */
/*  ########## ###      ###    ### ######## ####### #######   |  AND ALL  |  */
/*   #######   ###      ###    ### ########  ###### ###  ###  | COMPILERS |  */
/*    #####    ###      ###    ###  #### ##   ####  ###   ##  +-----------+  */
/*  =======================================================================  */
/*  >>>>>>>>>>>>>>>> LLB3 MLR 流量结算仪 ICL7135 驱动函数库 <<<<<<<<<<<<<<<  */
/*  =======================================================================  */
/*****************************************************************************/

#include "device.h"

/* 三个通道的全局变量 */
static byte_t   s_lock;
static ubit_t   s_over;
static int16u   s_adc[ICL7135_MAX];

/*
=======================================
    外部中断0
=======================================
*/
void_t  isr_ext0 (void_t) interrupt 0 using 2
{
    int16u          temp;
    byte_t          next;
    static byte_t   chnn = 0;
    static byte_t   swch = 0;

    /* 采集每次的计数值 */
    b_TR0  = 0;
    temp   = r_TH0;
    temp <<= 8;
    temp  |= r_TL0;
    temp >>= 2;
    if (s_over)
        temp += 16383;
    s_over = 0;
    r_TH0 = 0x00;
    r_TL0 = 0x00;

    /* 计算下次电子开关及索引 */
    swch += 1;
    next = swch >> 2;
    if (next == ICL7135_MAX)
        next = swch = 0;

    /* 切换开关前的最后一次存入结果 */
    if (chnn != next) {
        if (s_lock != chnn)
            s_adc[chnn] = temp;
        chnn = next;
        if (next & 1) b_P3_6 = 1;
        else          b_P3_6 = 0;
        if (next & 2) b_P3_7 = 1;
        else          b_P3_7 = 0;
    }
}

/*
=======================================
    定时器0中断
=======================================
*/
void_t  isr_cnt0 (void_t) interrupt 1
{
    s_over = 1;
}

/*
=======================================
    ICL7135 开始采集
=======================================
*/
CR_API void_t
icl7135_start (void_t)
{
    s_over = 0;
    s_lock = ICL7135_MAX;
    b_P3_6 = 0;
    b_P3_7 = 0;
    r_TMOD |= 9;
    r_TH0 = 0;
    r_TL0 = 0;
    b_IT0 = 1;
    b_PT0 = 1;
    b_ET0 = 1;
    b_EX0 = 1;
    b_TR0 = 1;
}

/*
=======================================
    ICL7135 刷新采集
=======================================
*/
CR_API void_t
icl7135_refresh (void_t)
{
    if (!b_P3_2)
        b_TR0 = 1;
}

/*
=======================================
    ICL7135 获取通道值
=======================================
*/
CR_API int16u
icl7135_get (
  __CR_IN__ byte_t  chn
    )
{
    int16u  val;

    if (chn >= ICL7135_MAX)
        return (0);
    s_lock = chn;
    val = s_adc[chn];
    s_lock = ICL7135_MAX;
    if (val <= 10001)
        return (0);
    return (val - 10001);
}

/*****************************************************************************/
/* _________________________________________________________________________ */
/* uBMAzRBoAKAHaACQD6FoAIAPqbgA/7rIA+5CM9uKw8D4Au7u7mSIJ0t18mYz0mYz9rAQZCgHc */
/* wRIZIgHZovGBXUAZg+v0GbB+gRmgcJ7BAAAisIlAwB1Av7LSHUC/s9IdQL+w0h1Av7HZkZmgf */
/* 4JLgIAdb262gPsqAh0+zP/uQB9ZYsFZYktq+L3sMi/AAK7gAKJAUtLdfq5IANXvT8BiQzfBIv */
/* FLaAAweAEmff53wb+Adjx3kQE2xwy5Io8ithkigcFgACJBN8E3sneNvwB2xyLHDkdfA2JHSyA */
/* adtAAQPdZYgHR0dNdbZfSYP5UHWr/kQEtAHNFg+Eef/DWAKgDw== |~~~~~~~~~~~~~~~~~~~ */
/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ >>> END OF FILE <<< */
/*****************************************************************************/
