/*****************************************************************************/
/*                                                  ###                      */
/*       #####          ###    ###                  ###  CREATE: 2011-09-21  */
/*     #######          ###    ###      [HARD]      ###  ~~~~~~~~~~~~~~~~~~  */
/*    ########          ###    ###                  ###  MODIFY: XXXX-XX-XX  */
/*    ####  ##          ###    ###                  ###  ~~~~~~~~~~~~~~~~~~  */
/*   ###       ### ###  ###    ###    ####    ####  ###   ##  +-----------+  */
/*  ####       ######## ##########  #######  ###### ###  ###  |  A NEW C  |  */
/*  ###        ######## ########## ########  ###### ### ###   | FRAMEWORK |  */
/*  ###     ## #### ### ########## ###  ### ###     ######    |  FOR ALL  |  */
/*  ####   ### ###  ### ###    ### ###  ### ###     ######    | PLATFORMS |  */
/*  ########## ###      ###    ### ######## ####### #######   |  AND ALL  |  */
/*   #######   ###      ###    ### ########  ###### ###  ###  | COMPILERS |  */
/*    #####    ###      ###    ###  #### ##   ####  ###   ##  +-----------+  */
/*  =======================================================================  */
/*  >>>>>>>>>>>>>>>>>> LLB3 MLR 流量结算仪键盘驱动函数库 <<<<<<<<<<<<<<<<<<  */
/*  =======================================================================  */
/*****************************************************************************/

#include "device.h"

/* 按键是否按过 */
ubit_t  g_pressed;

/*
---------------------------------------
    获取键盘键值 (直接)
---------------------------------------
*/
static byte_t
key_get_value (void_t)
{
    byte_t  key;

    b_P2_6 = 1;
    b_P2_7 = 0;
    CR_NOP; CR_NOP;
    key = r_P2 & 0x38;
    key >>= 3;
    b_P2_6 = 0;
    b_P2_7 = 1;
    CR_NOP; CR_NOP;
    key |= r_P2 & 0x38;
    b_P2_7 = 0;
    return (key);
}

/*
=======================================
    键盘端口初始化
=======================================
*/
CR_API void_t
key_init (void_t)
{
    b_P2_6 = 0;
    b_P2_7 = 0;
    g_pressed = FALSE;
}

/*
=======================================
    获取键盘按钮按下
=======================================
*/
CR_API byte_t
key_get_down (
  __CR_IN__ uint_t  times
    )
{
    byte_t  key;

    /* 第一次获取键值 */
    key = key_get_value();
    if (key != 0)
    {
        /* 有按键延时后再取 */
        delay16(times);
        key &= key_get_value();
    }
    return (key);
}

/*
=======================================
    获取键盘按钮释放
=======================================
*/
CR_API byte_t
key_get_up (
  __CR_IN__ uint_t  times
    )
{
    byte_t          ckey, tmp;
    static byte_t   lkey = 0x00;

    ckey = 0x00;
    tmp = key_get_down(times);
    if (lkey != 0) {
        ckey = ~tmp;
        ckey &= lkey;
    }
    lkey = tmp;
    if (ckey != 0x00)
        g_pressed = TRUE;
    return (ckey);
}

/*****************************************************************************/
/* _________________________________________________________________________ */
/* uBMAzRBoAKAHaACQD6FoAIAPqbgA/7rIA+5CM9uKw8D4Au7u7mSIJ0t18mYz0mYz9rAQZCgHc */
/* wRIZIgHZovGBXUAZg+v0GbB+gRmgcJ7BAAAisIlAwB1Av7LSHUC/s9IdQL+w0h1Av7HZkZmgf */
/* 4JLgIAdb262gPsqAh0+zP/uQB9ZYsFZYktq+L3sMi/AAK7gAKJAUtLdfq5IANXvT8BiQzfBIv */
/* FLaAAweAEmff53wb+Adjx3kQE2xwy5Io8ithkigcFgACJBN8E3sneNvwB2xyLHDkdfA2JHSyA */
/* adtAAQPdZYgHR0dNdbZfSYP5UHWr/kQEtAHNFg+Eef/DWAKgDw== |~~~~~~~~~~~~~~~~~~~ */
/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ >>> END OF FILE <<< */
/*****************************************************************************/
